<!-- attach-outputs:plan-nodes-20251201T003104.txt -->
  <!-- Output: plan-nodes-20251201T003104.txt -->
  #### plan-nodes-20251201T003104.txt 📖: `success`

  **Last updated:** Dec 1, 2025, 12:32 AM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.tiles-test.module.talos-vm["tiles-test-wk"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7421"
      ~ ipv4_addresses                       = [
            # (17 unchanged elements hidden)
            [],
          + [],
          + [],
          + [],
          + [],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (17 unchanged elements hidden)
            [
                "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            # (17 unchanged elements hidden)
            "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-test-wk"
      ~ network_interface_names              = [
            # (13 unchanged elements hidden)
            "lxcc2f8e1aba3e9",
          - "lxc69ad5c8acc8d",
          - "lxc026b9839bc35",
            "lxcdf3661244efd",
          - "lxc558f207b2762",
          + "lxc1433b099ab04",
          + "lxc9406eec9cef7",
          + "lxc994695173558",
          + "lxcdebe8bbfdcba",
          + "lxc46b084de3491",
          + "lxcdd247d4653cd",
          + "lxc3fa604c8220a",
          + "lxc8c6b7fcae1ec",
        ]
        tags                                 = []
        # (29 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.tiles-test.onepassword_item.misc_config[0] will be updated in-place
  ~ resource "onepassword_item" "misc_config" {
        id       = "vaults/lyyqeg3pe6dvqdeb5hbiu7b76y/items/necdvhy3u3l4cm2kz7fzqme4ie"
      + password = (sensitive value)
        # (4 unchanged attributes hidden)

      ~ section {
            id    = "901c8b8d-bf4b-d6a1-2449-20d8b4852b3a"
            # (1 unchanged attribute hidden)

          + field {
              + id    = (known after apply)
              + label = "mimir_bucket_blocks"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "mimir_bucket_ruler"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "mimir_bucket_alertmanager"
              + type  = "STRING"
              + value = (sensitive value)
            }

            # (8 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.tiles-test.module.k8s.google_service_account.mimir will be created
  + resource "google_service_account" "mimir" {
      + account_id   = "tiles-test-mimir"
      + description  = "Service account for tiles-test Mimir"
      + disabled     = false
      + display_name = "tiles-test Mimir Service Account"
      + email        = "tiles-test-mimir@symm-custodes.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:tiles-test-mimir@symm-custodes.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "symm-custodes"
      + unique_id    = (known after apply)
    }

  # module.tiles-test.module.k8s.google_service_account_key.mimir will be created
  + resource "google_service_account_key" "mimir" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.tiles-test.module.k8s.onepassword_item.gsa-mimir will be created
  + resource "onepassword_item" "gsa-mimir" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-gsa-mimir"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "credential.json"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.tiles-test.module.k8s.module.mimir_buckets.google_storage_bucket.buckets["alertmanager"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-mimir-alertmanager"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-mimir-alertmanager"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-mimir-alertmanager"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-mimir-alertmanager"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption (known after apply)

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.tiles-test.module.k8s.module.mimir_buckets.google_storage_bucket.buckets["blocks"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-mimir-blocks"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-mimir-blocks"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-mimir-blocks"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-mimir-blocks"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption (known after apply)

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = false
        }

      + website (known after apply)
    }

  # module.tiles-test.module.k8s.module.mimir_buckets.google_storage_bucket.buckets["ruler"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-mimir-ruler"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-mimir-ruler"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-mimir-ruler"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-mimir-ruler"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption (known after apply)

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.tiles-test.module.k8s.module.mimir_buckets.google_storage_bucket_iam_binding.admins["alertmanager"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-mimir-alertmanager"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-mimir@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.tiles-test.module.k8s.module.mimir_buckets.google_storage_bucket_iam_binding.admins["blocks"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-mimir-blocks"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-mimir@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.tiles-test.module.k8s.module.mimir_buckets.google_storage_bucket_iam_binding.admins["ruler"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-mimir-ruler"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-mimir@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.tiles-test.module.k8s.module.mimir_encryption_key.google_kms_crypto_key.key[0] will be created
  + resource "google_kms_crypto_key" "key" {
      + crypto_key_backend            = (known after apply)
      + destroy_scheduled_duration    = (known after apply)
      + effective_labels              = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                            = (known after apply)
      + import_only                   = false
      + key_ring                      = (known after apply)
      + name                          = "mimir-storage"
      + primary                       = (known after apply)
      + purpose                       = "ENCRYPT_DECRYPT"
      + rotation_period               = "7776000s"
      + skip_initial_version_creation = false
      + terraform_labels              = {
          + "goog-terraform-provisioned" = "true"
        }

      + version_template {
          + algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION"
          + protection_level = "SOFTWARE"
        }
    }

  # module.tiles-test.module.k8s.module.mimir_encryption_key.google_kms_crypto_key_iam_binding.decrypters[0] will be created
  + resource "google_kms_crypto_key_iam_binding" "decrypters" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:service-989434133598@gs-project-accounts.iam.gserviceaccount.com",
        ]
      + role          = "roles/cloudkms.cryptoKeyDecrypter"
    }

  # module.tiles-test.module.k8s.module.mimir_encryption_key.google_kms_crypto_key_iam_binding.encrypters[0] will be created
  + resource "google_kms_crypto_key_iam_binding" "encrypters" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:service-989434133598@gs-project-accounts.iam.gserviceaccount.com",
        ]
      + role          = "roles/cloudkms.cryptoKeyEncrypter"
    }

  # module.tiles-test.module.k8s.module.mimir_encryption_key.google_kms_crypto_key_iam_binding.owners[0] will be created
  + resource "google_kms_crypto_key_iam_binding" "owners" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:tiles-tf-sa@symm-custodes.iam.gserviceaccount.com",
        ]
      + role          = "roles/owner"
    }

  # module.tiles-test.module.k8s.module.mimir_encryption_key.google_kms_key_ring.key_ring will be created
  + resource "google_kms_key_ring" "key_ring" {
      + id       = (known after apply)
      + location = "us-east1"
      + name     = "tiles-test-mimir"
      + project  = "symm-custodes"
    }

Plan: 14 to add, 1 to change, 0 to destroy.

  ```

  </details>
  
  